{
  "intents": [
    {
      "tag": "greetings",
      "patterns": ["hello", "hi", "hey", "howdy", "greetings", "good morning", "good evening", "good afternoon", "how are you?"],
      "responses": ["Hello! How can I assist you today?", "Hi there! How can I help?", "Hey! What can I do for you?"]
    },
    {
      "tag": "opening_hours",
      "patterns": ["What are the university's opening hours?", "When does the university open and close?", "Opening hours"],
      "responses": ["The university is open from Monday to Friday, 8:00 AM to 5:00 PM. We are closed on weekends."]
    },
    {
      "tag": "exam_periods",
      "patterns": ["When are the exam periods?", "Exam schedule", "Upcoming exams"],
      "responses": ["The exam periods are typically in December and April. However, please check the academic calendar for specific dates."]
    },
    {
      "tag": "lesson_times",
      "patterns": ["What are the lesson times?", "Class schedule", "Lecture timings"],
      "responses": ["Lesson times vary. You can find your specific class schedule in your student portal or contact your department for details."]
    },
    {
      "tag": "office_locations",
      "patterns": ["Where are the main offices located?", "Office locations", "Where is the registrar's office?"],
      "responses": ["Main offices, including the registrar's office, are located in the central administration building. You can also check the campus map for details."]
    },
    {
      "tag": "fee_structure",
      "patterns": ["How much are the tuition fees?", "Tell me about the fee structure", "Fee inquiry"],
      "responses": ["For information on tuition fees and the fee structure, please visit the finance department's webpage or contact them directly."]
    },
    {
      "tag": "exam_retakes",
      "patterns": ["Can I retake exams?", "Exam retake policy", "Retaking exams"],
      "responses": ["Yes, you can retake exams. Please review the university's exam retake policy for more details and procedures."]
    },
    {
      "tag": "supplementary_procedures",
      "patterns": ["Tell me about supplementary exam procedures", "How to apply for a supplementary exam?", "Supplementary exams"],
      "responses": ["Supplementary exam procedures vary. Check with your department or the exams office for specific guidelines and application processes."]
    },
    {
      "tag": "special_dates",
      "patterns": ["Are there any special dates I should be aware of?", "University events", "Special occasions"],
      "responses": ["Special dates, events, and holidays are listed on the university calendar. Check the calendar for important announcements and celebrations."]
    },
    {
  "tag": "admissions_information",
  "patterns": [
    "What are the admission requirements for different courses?",
    "Can you tell me about the entry criteria?",
    "What qualifications do I need to apply for a course?"
  ],
  "responses": [
    "The admission requirements for our various courses are as follows:\n\nCertificate Courses:\n- Minimum mean grade of D+ in KCSE or its equivalent (C Plain or pass or credit in respective subjects).\n- Obtained subsidiary passes in A-level or International Baccalaureate or its equivalent.\n\nDiploma Courses:\n- Mean grade of C- minus in KCSE.\n- Diploma in Law - KCSE mean grade of C Plain and C+ in English or Kiswahili.\n- Diploma in Early Childhood Development & Education - KCSE mean grade of C.\n- Obtained subsidiaries or a principal pass in Advanced certificate (A-level) or credit pass in International Baccalaureate “IB”.\n- A credit pass at Certificate level.\n\nACCA / CPA / CS:\n- Relevant qualifications apply.\n\nUndergraduate Courses:\n- A minimum mean grade of C+ (plus).\n- Advanced Certificate of Education GCE or A-levels applicants must have at least 2 principal passes and one subsidiary pass or its equivalent and must have passed in subjects related to the course applied for.\n- Diploma or professional certificate in a relevant discipline from an institution recognized by the University Senate.\n- Advanced Diploma in a relevant field, applicant must have an ordinary Diploma from a recognized institution.\n- Pre-University certificate with a mean of C+ (plus) and above from a recognized institution, and must have scored a C in KCSE or its equivalent.\n\nNON-KENYANS:\n- Admission is subject to equated qualifications by the Kenya National Qualifications Authority (KNQA).\n- Must have satisfied the minimum University entry requirement in their country and meet departmental requirements for the subjects applied for.\n- Candidates from non-English speaking countries should demonstrate proficiency in written and spoken English or undertake certificate in English course."
  ]
}


  ]
}
